src/cf/InformationRegisters/ПараметрыRabbitMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыRabbitMQ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПараметрыRabbitMQ/Ext/ManagerModule.bsl
Функция ИменаПараметров() Экспорт
	ИменаПараметров = Новый Массив;
	ИменаПараметров.Добавить("Адрес");
	ИменаПараметров.Добавить("Порт");
	ИменаПараметров.Добавить("Логин");
	ИменаПараметров.Добавить("Пароль");
	ИменаПараметров.Добавить("ВиртуальныйХост");
	ИменаПараметров.Добавить("ТочкаОбмена");
	ИменаПараметров.Добавить("ИмяОчереди");
	ИменаПараметров.Добавить("КлючМаршрутизации");
	Возврат ИменаПараметров;
КонецФункции

Функция ЗначенияПараметров() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыRabbitMQ.Имя КАК Имя,
	|	ПараметрыRabbitMQ.Аналитика КАК Аналитика,
	|	ПараметрыRabbitMQ.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ПараметрыRabbitMQ КАК ПараметрыRabbitMQ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ЗначенияПараметров = Новый Структура;
	Пока Выборка.Следующий() Цикл
		Значение = Неопределено;
		ЗначенияПараметров.Свойство(Выборка.Имя, Значение);
		Если Значение = Неопределено Тогда
			Если ЗначениеЗаполнено(Выборка.Аналитика) Тогда
				КоллекцияЗначений = Новый Соответствие;
				КоллекцияЗначений.Вставить(Выборка.Аналитика, Выборка.Значение);
				ЗначенияПараметров.Вставить(Выборка.Имя, КоллекцияЗначений);
			Иначе
				ЗначенияПараметров.Вставить(Выборка.Имя, Выборка.Значение);
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Выборка.Аналитика) Тогда
				Если ТипЗнч(Значение) = Тип("Соответствие") Тогда
					КоллекцияЗначений = Значение;
				Иначе
					КоллекцияЗначений = Новый Соответствие;
					КоллекцияЗначений.Вставить("", Значение);
				КонецЕсли;
				КоллекцияЗначений.Вставить(Выборка.Аналитика, Выборка.Значение);
			Иначе
				Если ТипЗнч(Значение) = Тип("Массив") Тогда
					КоллекцияЗначений = Значение;
				Иначе
					КоллекцияЗначений = Новый Массив;
					КоллекцияЗначений.Добавить(Значение);
				КонецЕсли;
				КоллекцияЗначений.Добавить(Выборка.Значение);
			КонецЕсли;
			
			ЗначенияПараметров.Вставить(Выборка.Имя, КоллекцияЗначений);
		КонецЕсли;
	КонецЦикла;
	Возврат ЗначенияПараметров;
КонецФункции

Процедура ЗаполнитьДоступныеПараметры() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗИмена.Имя КАК Имя
	|ПОМЕСТИТЬ ВТ_Имена
	|ИЗ
	|	&ТЗИмена КАК ТЗИмена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Имена.Имя КАК Имя
	|ИЗ
	|	ВТ_Имена КАК ВТ_Имена
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыRabbitMQ КАК ПараметрыRabbitMQ
	|		ПО ВТ_Имена.Имя = ПараметрыRabbitMQ.Имя
	|ГДЕ
	|	ПараметрыRabbitMQ.Значение ЕСТЬ NULL";
	
	ТЗИмена = Новый ТаблицаЗначений;
	ТЗИмена.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	Для Каждого ИмяПараметра Из РегистрыСведений.ПараметрыRabbitMQ.ИменаПараметров() Цикл
		ТЗИмена.Добавить().Имя = ИмяПараметра;
	КонецЦикла;
	Запрос.УстановитьПараметр("ТЗИмена", ТЗИмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ПараметрыRabbitMQ.СоздатьМенеджерЗаписи();	
		МенеджерЗаписи.Имя = Выборка.Имя;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры
